/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_memset.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hgranule <wp3d3p@yandex.ru>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/05/01 14:24:00 by amarcele          #+#    #+#             */
/*   Updated: 2020/05/19 19:22:28 by hgranule         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void	*ft_memset(void *s, int c, size_t n)
{
	int i;

	i = 0;
	while (n != 0)
	{
		((unsigned char *)s)[i] = c; // новуую переменную, не надо каставания
		i++;
		n--;
	}
	return (s);
}
